# Transformação de dados com Pandas

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("..\\dados\\fortune500.csv")

In [4]:
df.head()

   year  rank           company  revenue ($ millions) profit ($ millions)
0  1955     1    General Motors                9823.5               806.0
1  1955     2       Exxon Mobil                5661.4               584.8
2  1955     3        U.S. Steel                3250.4               195.4
3  1955     4  General Electric                2959.1               212.6
4  1955     5            Esmark                2510.8                19.1

In [5]:
df.head(3)

   year  rank         company  revenue ($ millions) profit ($ millions)
0  1955     1  General Motors                9823.5               806.0
1  1955     2     Exxon Mobil                5661.4               584.8
2  1955     3      U.S. Steel                3250.4               195.4

In [6]:
df.tail()

,year,rank,company,revenue ($ millions),profit ($ millions)
32495,2019,496,Simon Property Group,5657.9,2440.1
32496,2019,497,Navient,5610.0,395.0
32497,2019,498,Western Union,5589.9,851.9
32498,2019,499,Peabody Energy,5581.8,646.9
32499,2019,500,Levi Strauss,5575.4,283.1

In [8]:
df.columns = ["year", "rank", "company", "revenue", "profit"]
df.head()

   year  rank           company  revenue profit
0  1955     1    General Motors   9823.5  806.0
1  1955     2       Exxon Mobil   5661.4  584.8
2  1955     3        U.S. Steel   3250.4  195.4
3  1955     4  General Electric   2959.1  212.6
4  1955     5            Esmark   2510.8   19.1

In [9]:
len(df)

32500

In [10]:
df.dtypes

year         int64
rank         int64
company     object
revenue    float64
profit      object
dtype: object

In [15]:
numeric_profits = df.profit.str.contains("^\-?[0-9]+\.?[0-9]*$")  # regular expression / RegEx
numeric_profits

0        True
1        True
2        True
3        True
4        True
         ...
32495    True
32496    True
32497    True
32498    True
32499    True
Name: profit, Length: 32498, dtype: bool

In [16]:
numeric_profits.unique()

array([ True, False])

In [14]:
df = df.dropna()
len(df)

32498

In [17]:
df.loc[~numeric_profits].head()

     year  rank                company  revenue profit
228  1955   229                 Norton    135.0   N.A.
290  1955   291        Schlitz Brewing    100.0   N.A.
294  1955   295  Pacific Vegetable Oil     97.9   N.A.
296  1955   297     Liebmann Breweries     96.0   N.A.
352  1955   353     Minneapolis-Moline     77.4   N.A.

In [18]:
len(df.loc[~numeric_profits])

374

In [19]:
set(df.profit[~numeric_profits])

{'N.A.'}

In [20]:
df = df[numeric_profits]
len(df)

32124

In [21]:
df.profit = df.profit.apply(pd.to_numeric)

In [22]:
df.dtypes

year         int64
rank         int64
company     object
revenue    float64
profit     float64
dtype: object